IdeaRS.OpenModel.Detail.ReinfAroundOpening
Representing reinforcement around opening in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfAroundOpening.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfAroundOpening.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfAroundOpening.NumOfLayers
Number of layers

IdeaRS.OpenModel.Detail.ReinfAroundOpening.Distance
Distance between reinforcement layers

IdeaRS.OpenModel.Detail.ReinfAroundOpening.AnchorLength
Anchor length of main bars

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalReinforcement
Add diagonal reinforcement

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalDiameter
Diameter of diagonal reinforcement

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalNumOfBarsInLayer
Number of diagonal bars in layer

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalNumOfLayers
Number of diagonal layers

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalDistance
Distance between diagonal reinforcement layers

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalLength
length of diagonal bar

IdeaRS.OpenModel.Detail.ReinfAroundOpening.DiagonalEndsType
End type of diagonal reinforcement bar